#Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.
#Формат входных данных
#На вход программе подаётся три целых числа, каждое на отдельной строке.
#Формат выходных данных
#Программа должна вывести сумму введенных чисел.

#me
a, b, c = int(input()), int(input()), int(input())
f = a + b + c
print(f)

#what i liked
a, b, c = int(input()), int(input()), int(input())
print(a + b + c)
