# Напишите программу вычисления значения функции f(a, \, b) = 3(a + b)^3 + 275b^2 - 127a - 41
# f(a,b) =3(a+b) 3 +275b 2 − 127a − 41 по введеным целым значениям aa и bb.



# me
a = int(input())
b = int(input())
print(3*((a+b)**3)+275*(b**2)-127*a-41)

# what i found
a, b = int(input()), int(input())
print(3 * (a+b)**3 + 275 * b**2 - 127 * a - 41)
